# MinimumColumnWidth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableView..::..MinimumColumnWidth Property
TableView Class See Also
---
Gets the minimum column width
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int MinimumColumnWidth { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MinimumColumnWidth As Integer
	Get
```

Visual C++
---
```text
public:
property int MinimumColumnWidth {
	int get ();
}
```

# See Also
TableView Class
Autodesk.Revit.DB Namespace